# 將其他class加入
import func


# global variable
flag = 0
x = 0
name = ""
關卡=0


print("早安，我今天心情很好，特別撥空來陪你玩冷笑話大對決，我宣布遊戲現正開始!")
input("前面有岔路，往左還是往右呢？ ")
print("pov：繼續前行...")
print("pov：你取得乾淨的水源木頭...")
print("...")
print("...")
print("...")
input("旁邊的樹看起來很奇異，感覺可以賣個好價格，是否砍伐？ ")
print("此時，煙霧彌漫...")
print("...")
print("...")
print("...")
print("這時，食人樹向你發動攻擊!")
input("你要反擊還是逃跑？ ")
print("pov：你動不了!")
print("pov：...")
print("巫婆：嘿嘿嘿")
print("巫婆：是個小鮮肉呢")

set()

print("巫婆：現在你有兩個選擇？")
print("巫婆：嫁給我或者心臓を捧げる？")
print("巫婆：幫我放巨人主題曲，pov")
print("pov：還有人在看爛尾劇喔？愛蓮...")
input("pov：你的選擇是... ")
print("巫婆：既然如此，就來打敗我吧!")

while flag != 2:
  
    if flag == 1:
      set()
    
    關卡set()
    
    if 關卡 == 1:
      print("巫婆：歡迎來到基礎題，看在你第一次來...本題目答錯只扣總分一分!")
      print("巫婆：接受試煉吧")
      關卡1("1", "大樹與小樹差在哪裡？", "1：土裡，2：大小", "沒錯就是插在土裡","再思考一次~")
      關卡1("1", "哪個國家不販售組合套餐？", "1：丹麥，2：台灣", "因為單賣~","台灣不是國家= = ")
      關卡1("2", "🐘的媽媽是？", "1：長頸鹿，2：猩猩，3：阿不就大象", "因為相由心生","一個成語")
    elif 關卡 == 2:
      print("巫婆：看來你透過基礎題之考驗了呢，接下來一題要扣兩分呢")
      print("巫婆：請享受接下來的饗宴吧")
      關卡2("3", "哪種螞蟻不能做朋友？", "1：白蟻，2：紅🐜，3：蟻后", "蟻后別做朋友~","周興哲")
      關卡2("2", "哪個皇帝最漂亮？", "1：武則天，2：秦始皇，3：慈禧太后", "因爲他暴政(爆正)","你知道...皇帝都是指男生嗎？")
      關卡2("2", "🦆的那個部位最瘦？", "1：尾巴，2：嘴巴，3：腳", "鴨嘴獸泰瑞","特務P！")
    elif 關卡 == 3:
      print("巫婆：你可別瞪鼻子上臉，最後一關要扣3條命的~")
      print("pov：最後一戰容不了任何錯誤的，奧力給")
      關卡3("2", "趕走貓咪要用什麼？", "1：掃把，2：斯斯，3：魚乾", "感冒(貓)用斯斯","廣告歌曲")
      關卡3("1", "哪種食物老了才會怕貓？", "1：薯條，2：罐頭，3：魚", "因為會變老🐭(薯)~","諧音梗combo")
      關卡3("3", "誰不能用手打手槍？", "1：女生，2：總統，3：神仙", "因爲仙人掌有刺","ㄟ嘿想不到吧")
      
    if x <= 0:
        flag = int(input("重新挑戰?\n1：yes，2：no："))
    else:
      關卡reset()
        

